# change dir
cask_args appdir: "/Applications"
# Taps
tap 'getantibody/tap'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'
tap 'wagoodman/dive'

# Binaries
brew 'autoconf'
brew 'automake'
brew 'autoenv'
brew 'bat'
brew 'bats-core'
brew 'ccat'
brew 'cmake'
brew 'colordiff'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dockutil'
brew 'findutils'
brew 'freetype'
brew 'gnupg'
brew 'gnu-sed'
brew 'grep'
brew 'libfido2'
brew 'git'
brew 'git-lfs'
brew 'git-recent'
brew 'gnutls'
brew 'gnupg'
brew 'grep'
# brew 'httpie'
brew 'hub'
brew 'libffi'
brew 'libmemcached'
brew 'libtiff'
brew 'libyaml'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'meilisearch'
brew 'memcached'
brew 'nmap'
brew 'ossp-uuid'
brew 'pass'
brew 'pipx'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stow'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'unrar'
brew 'wget'
brew 'zlib' # Needed for Memcached

# CLI stuff
brew 'bash' # Latest Bash version
brew 'bash-completion'
brew 'gh'
# brew 'neovim'
brew 'sshfs'
brew 'sshrc'
brew 'stunnel'
brew 'tmux'
brew 'vim', args: ['enable-gui']
# brew 'vim'
brew 'zsh'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

# media stuff
brew 'faac'
brew 'ffmpeg'
brew 'imagemagick'
brew 'jpeg'
brew 'jpegoptim'
brew 'media-info'
brew 'mp4v2'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
# brew 'gifsicle'
brew 'webp'


# Development
brew 'cocoapods'
brew 'composer'
brew 'docker-credential-helper-ecr'
brew 'go'
brew 'heroku'
brew 'hugo'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'openjdk'
brew 'openssh'
brew 'openssl'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'postgresql'
brew 'prettier'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'python3'
brew 'redis'
brew 'rpm'
brew 'ruby'
brew 'ruby-build'
brew 'rbenv'
brew 'rust'
brew 'yarn'

# GUI / CASK APPS
# Apps
cask 'basictex'
# cask 'caffeine'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'dropbox'
# cask 'figma'
cask 'firefox'
cask 'flux'
cask 'gas-mask'
cask 'github'
cask 'gpg-suite'
cask 'java'
cask 'maccy'
# cask 'imageoptim'
# cask 'insomnia'
cask 'osxfuse'
# cask 'pastebot'
# cask 'phpmon'
# cask 'phpstorm'
cask 'protonvpn'
cask 'rectangle'
# cask 'screenflow'
# cask 'signal'
# cask 'sublime-text'
cask 'session-manager-plugin'
cask 'suspicious-package'
cask 'the-unarchiver'
# cask 'tinkerwell'
cask 'transmission'
# cask 'transmit'
# cask 'tuple'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'vscodium'
cask 'zoomus'
cask 'zotero'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask "qlcolorcode"
cask "qlstephen"
cask "qlimagesize"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-cascadia-mono'
cask 'font-3270-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-front'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Slack', id: 803453959
# mas 'Sip', id: 507257563 
# mas 'Simplenote', id: 692867256 
# mas 'Todoist', id: 585829637
# mas 'Apple Configurator 2', id: 1037126344
# mas 'Boom 3D', id: 1233048948
# mas 'Medis', id: 1063631769
# mas 'MindNode', id: 1289197285
# mas "Drafts", id: 1435957248
mas "Xcode", id: 497799835
# mas "Magnet", id: 441258766
# mas "Coca", id: 1000808993
# mas "duckduckgo privacy essentials", id: 1482920575
# mas "pdf expert", id: 1055273043
# mas "Better", id: 1121192229
# mas "Caffeine", id: 411246225
# mas "DaisyDisk", id: 411643860
# mas "Fantastical 2", id: 975937182
# mas "iStat Mini", id: 927292435
# mas "Marked", id: 448925439
# mas "Soulver", id: 413965349
# mas "Spillo", id: 873245660
# mas "Stay", id: 435410196
# mas "The Hit List", id: 432764806
mas "The Unarchiver", id: 425424353
# mas 'iA Writer', id: 775737590